[net]
batch=64
subdivisions=8
width=608
height=608
channels=3
momentum=0.949
decay=0.0005
angle=0
saturation=1.5
exposure=1.5
hue=.1
learning_rate=0.0013
burn_in=1000
max_batches=500500
policy=steps
steps=400000,450000
scales=.1,.1
mosaic=1

[convolutional]
batch_normalize=1
filters=24
size=3
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=56
size=3
stride=2
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=47
size=1
stride=1
pad=1
activation=mish

[route]
layers=-2

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=30
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=mish

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=61
size=1
stride=1
pad=1
activation=mish

[route]
layers=-1,-7

[convolutional]
batch_normalize=1
filters=50
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=44
size=3
stride=2
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=32
size=1
stride=1
pad=1
activation=mish

[route]
layers=-2

[convolutional]
batch_normalize=1
filters=40
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=3
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=40
size=3
stride=1
pad=1
activation=mish

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=2
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=40
size=3
stride=1
pad=1
activation=mish

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=60
size=1
stride=1
pad=1
activation=mish

[route]
layers=-1,-10

[convolutional]
batch_normalize=1
filters=66
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=27
size=3
stride=2
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=20
size=1
stride=1
pad=1
activation=mish

[route]
layers=-2

[convolutional]
batch_normalize=1
filters=113
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=9
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=113
size=3
stride=1
pad=1
activation=mish

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=7
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=113
size=3
stride=1
pad=1
activation=mish

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=6
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=113
size=3
stride=1
pad=1
activation=mish

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=12
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=113
size=3
stride=1
pad=1
activation=mish

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=4
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=113
size=3
stride=1
pad=1
activation=mish

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=3
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=113
size=3
stride=1
pad=1
activation=mish

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=7
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=113
size=3
stride=1
pad=1
activation=mish

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=7
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=113
size=3
stride=1
pad=1
activation=mish

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=47
size=1
stride=1
pad=1
activation=mish

[route]
layers=-1,-28

[convolutional]
batch_normalize=1
filters=103
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=46
size=3
stride=2
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=39
size=1
stride=1
pad=1
activation=mish

[route]
layers=-2

[convolutional]
batch_normalize=1
filters=216
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=27
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=216
size=3
stride=1
pad=1
activation=mish

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=7
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=216
size=3
stride=1
pad=1
activation=mish

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=7
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=216
size=3
stride=1
pad=1
activation=mish

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=11
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=216
size=3
stride=1
pad=1
activation=mish

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=4
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=216
size=3
stride=1
pad=1
activation=mish

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=4
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=216
size=3
stride=1
pad=1
activation=mish

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=6
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=216
size=3
stride=1
pad=1
activation=mish

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=4
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=216
size=3
stride=1
pad=1
activation=mish

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=67
size=1
stride=1
pad=1
activation=mish

[route]
layers=-1,-28

[convolutional]
batch_normalize=1
filters=220
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=26
size=3
stride=2
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=23
size=1
stride=1
pad=1
activation=mish

[route]
layers=-2

[convolutional]
batch_normalize=1
filters=113
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=31
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=113
size=3
stride=1
pad=1
activation=mish

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=6
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=113
size=3
stride=1
pad=1
activation=mish

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=6
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=113
size=3
stride=1
pad=1
activation=mish

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=11
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=113
size=3
stride=1
pad=1
activation=mish

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=12
size=1
stride=1
pad=1
activation=mish

[route]
layers=-1,-16

[convolutional]
batch_normalize=1
filters=10
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=5
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=16
activation=leaky

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=leaky

[maxpool]
stride=1
size=5

[route]
layers=-2

[maxpool]
stride=1
size=9

[route]
layers=-4

[maxpool]
stride=1
size=13

[route]
layers=-1,-3,-5,-6

[convolutional]
batch_normalize=1
filters=70
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=23
activation=leaky

[convolutional]
batch_normalize=1
filters=7
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=2

[route]
layers=85

[convolutional]
batch_normalize=1
filters=182
size=1
stride=1
pad=1
activation=leaky

[route]
layers=-1, -3

[convolutional]
batch_normalize=1
filters=218
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=101
activation=leaky

[convolutional]
batch_normalize=1
filters=141
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=49
activation=leaky

[convolutional]
batch_normalize=1
filters=20
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=2

[route]
layers=54

[convolutional]
batch_normalize=1
filters=47
size=1
stride=1
pad=1
activation=leaky

[route]
layers=-1, -3

[convolutional]
batch_normalize=1
filters=86
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=88
activation=leaky

[convolutional]
batch_normalize=1
filters=91
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=106
activation=leaky

[convolutional]
batch_normalize=1
filters=106
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=16
activation=leaky

[convolutional]
size=1
stride=1
pad=1
filters=255
activation=linear

[yolo]
mask=0,1,2
anchors=12,16, 19,36, 40,28, 36,75, 76,55, 72,146, 142,110, 192,243, 459,401
classes=80
num=9
jitter=.3
ignore_thresh=.7
truth_thresh=1
scale_x_y=1.2
iou_thresh=0.213
cls_normalizer=1.0
iou_normalizer=0.07
iou_loss=ciou
nms_kind=greedynms
beta_nms=0.6
max_delta=5

[route]
layers=-4

[convolutional]
batch_normalize=1
size=3
stride=2
pad=1
filters=36
activation=leaky

[route]
layers=-1, -16

[convolutional]
batch_normalize=1
filters=52
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=11
activation=leaky

[convolutional]
batch_normalize=1
filters=56
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=17
activation=leaky

[convolutional]
batch_normalize=1
filters=89
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=7
activation=leaky

[convolutional]
size=1
stride=1
pad=1
filters=255
activation=linear

[yolo]
mask=3,4,5
anchors=12,16, 19,36, 40,28, 36,75, 76,55, 72,146, 142,110, 192,243, 459,401
classes=80
num=9
jitter=.3
ignore_thresh=.7
truth_thresh=1
scale_x_y=1.1
iou_thresh=0.213
cls_normalizer=1.0
iou_normalizer=0.07
iou_loss=ciou
nms_kind=greedynms
beta_nms=0.6
max_delta=5

[route]
layers=-4

[convolutional]
batch_normalize=1
size=3
stride=2
pad=1
filters=7
activation=leaky

[route]
layers=-1, -37

[convolutional]
batch_normalize=1
filters=5
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=10
activation=leaky

[convolutional]
batch_normalize=1
filters=5
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=10
activation=leaky

[convolutional]
batch_normalize=1
filters=5
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=10
activation=leaky

[convolutional]
size=1
stride=1
pad=1
filters=255
activation=linear

[yolo]
mask=6,7,8
anchors=12,16, 19,36, 40,28, 36,75, 76,55, 72,146, 142,110, 192,243, 459,401
classes=80
num=9
jitter=.3
ignore_thresh=.7
truth_thresh=1
random=1
scale_x_y=1.05
iou_thresh=0.213
cls_normalizer=1.0
iou_normalizer=0.07
iou_loss=ciou
nms_kind=greedynms
beta_nms=0.6
max_delta=5

